In [1]:
import pandas as pd
import numpy as np
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
titanic_test = pd.read_csv('test.csv')

In [3]:
titanic_test.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [4]:
len(titanic_test)

418

In [5]:
titanic_train = pd.read_csv('train.csv')

In [6]:
titanic_train.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [7]:
titanic_gender = pd.read_csv('gender_submission.csv')

In [8]:
titanic_gender.head(2)

   PassengerId  Survived
0          892         0
1          893         1

In [9]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
del titanic_train['Cabin']
del titanic_test['Cabin']

In [11]:
del titanic_train['Embarked']
del titanic_test['Embarked']

In [12]:
titanic_train = titanic_train.dropna()

In [13]:
titanic_test.isnull().any()

PassengerId    False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare            True
dtype: bool

In [14]:
titanic_test['Age'].fillna((titanic_test['Age'].mean()), inplace=True)

In [15]:
titanic_test['Fare'].fillna((titanic_test['Fare'].mean()), inplace=True)

In [16]:
titanic_test.isnull().any()

PassengerId    False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
dtype: bool

In [17]:
titanic_test.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000

In [18]:
features = ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare']

In [19]:
titanic_train.at[titanic_train[titanic_train['Sex'] == 'male'].index, 'Sex'] = 1
titanic_train.at[titanic_train[titanic_train['Sex'] == 'female'].index, 'Sex'] = 0
titanic_test.at[titanic_test[titanic_test['Sex'] == 'male'].index, 'Sex'] = 1
titanic_test.at[titanic_test[titanic_test['Sex'] == 'female'].index, 'Sex'] = 0

In [20]:
titanic_train.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833

In [21]:
y=titanic_train[['Survived']].copy()

In [22]:
X = titanic_train[features].copy()

In [23]:
X.index = titanic_train['PassengerId']

In [24]:
X.head(2)

             Pclass  Sex   Age  SibSp  Parch     Fare
PassengerId
1                 3    1  22.0      1      0   7.2500
2                 1    0  38.0      1      0  71.2833

In [25]:
y.columns

Index(['Survived'], dtype='object')

In [26]:
X.columns

Index(['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [27]:
X_train = X

In [28]:
X_test = titanic_test[features].copy()
X_test.index = titanic_test['PassengerId']

In [29]:
y_train = y

In [30]:
suvived_classifier = DecisionTreeClassifier(max_leaf_nodes=7, random_state=0)
suvived_classifier.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=7, min_impurity_decrease=0.0,
            min_impurity_split=None, min_samples_leaf=1,
            min_samples_split=2, min_weight_fraction_leaf=0.0,
            presort=False, random_state=0, splitter='best')

In [32]:
predictions = suvived_classifier.predict(X_test)

In [33]:
predictions[:10]

array([0, 1, 0, 0, 1, 0, 1, 0, 1, 0], dtype=int64)

In [34]:
#accuracy_score(y_true = y_test, y_pred = predictions)

In [35]:
final = X_test[['Pclass']]

In [36]:
final.index.name = ''
final['PassengerId'] = final.index
final['Survived'] = predictions
final.head()

C:\Users\kindk\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

C:\Users\kindk\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

     Pclass  PassengerId  Survived

892       3          892         0
893       3          893         1
894       2          894         0
895       3          895         0
896       3          896         1

In [37]:
del final['Pclass']

In [38]:
len(final)

418

In [39]:
final.index = np.arange(len(final))

In [40]:
final.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [41]:
final.to_csv('submission.csv', sep=',', index=False)

In [42]:
data = pd.read_csv('submission.csv')

In [44]:
data.tail(20)

     PassengerId  Survived
398         1290         0
399         1291         0
400         1292         1
401         1293         0
402         1294         1
403         1295         0
404         1296         0
405         1297         0
406         1298         0
407         1299         0
408         1300         1
409         1301         1
410         1302         1
411         1303         1
412         1304         1
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0